In [1]:
import pandas as pd
import numpy as np
import math
import re
from scipy.sparse import csr_matrix
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style("darkgrid")

In [2]:
movies = pd.read_csv('./datasets/movie_titles.csv', encoding='latin1', usecols = [0,1,2], names = ['Movie_Id','Year', 'Title']).set_index('Movie_Id')
movies.sample(10)

            Year                        Title
Movie_Id
7478      1987.0       Tour of Duty: Season 1
7240      1987.0         Beverly Hills Cop II
7766      2002.0           Endangered Species
9491      1981.0          The Woman Next Door
5673      2004.0        Batman: Holy Batmania
13254     2000.0            Steal This Movie!
14617     1965.0   The Three Stooges Cartoons
679       1990.0           R.E.M.: Pop Screen
17600     2004.0  James' Journey to Jerusalem
4867      1986.0       The Karate Kid Part II

In [3]:
movies.shape

(17770, 2)

In [4]:
metadata = pd.read_csv('./movies_metadata.csv', low_memory=False)

In [5]:
metadata = metadata.set_index('original_title').dropna()

In [6]:
metadata.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'overview', 'popularity', 'poster_path',
       'production_companies', 'production_countries', 'release_date',
       'revenue', 'runtime', 'spoken_languages', 'status', 'tagline', 'title',
       'video', 'vote_average', 'vote_count'],
      dtype='object')

In [7]:
metadata.shape

(693, 23)

In [8]:
metadata = metadata[['genres','imdb_id']]

In [9]:
metadata.sample(5)

,genres,imdb_id
original_title,,
Born To Race,"[{'id': 28, 'name': 'Action'}]",tt1781781
God's Not Dead,"[{'id': 18, 'name': 'Drama'}]",tt2528814
ポケモン・ザ・ムービーXY 光輪の超魔神 フーパ,"[{'id': 12, 'name': 'Adventure'}, {'id': 16, '...",tt4503906
Bad Ass,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",tt1928330
In the Name of the King: A Dungeon Siege Tale,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",tt0460780

In [10]:
# it seems that metadata is much smaller than the movies dataset. therefore, decide not to use, and get more data from imdb.

In [11]:
# but first. gonna build a recommender based on the data that was provided. to use as a baseline...

In [12]:
# recommender got baseline? hmmmmmmmmmmmmmm

In [5]:
combined = pd.read_csv('./Sample of ratings with movies.csv')

In [6]:
combined.head()

   Unnamed: 0  Cust_Id  Rating        Date  Movie_Id    Year            Title
0           0   822109     5.0  2005-05-13         1  2003.0  Dinosaur Planet
1           1   372233     5.0  2005-11-23         1  2003.0  Dinosaur Planet
2           2   401047     4.0  2005-06-03         1  2003.0  Dinosaur Planet
3           3   793564     4.0  2004-04-19         1  2003.0  Dinosaur Planet
4           4  2477242     5.0  2005-01-30         1  2003.0  Dinosaur Planet

In [7]:
combined.drop('Unnamed: 0', axis=1, inplace=True)

In [8]:
combined.sample(5)

         Cust_Id  Rating        Date  Movie_Id    Year              Title
819259   2579734     3.0  2005-05-16      2942  1999.0  Friends: Season 6
447240   1463201     4.0  2002-02-07      1659  1993.0     Grumpy Old Men
722617   1208766     3.0  2004-05-21      2580  2003.0      Freaky Friday
33726     133172     3.0  2004-06-14       175  1992.0     Reservoir Dogs
1170924  2183302     1.0  2004-05-26      4127  1994.0    The Flintstones

In [9]:
combined.shape

(1285340, 6)

In [10]:
combined.dtypes

Cust_Id       int64
Rating      float64
Date         object
Movie_Id      int64
Year        float64
Title        object
dtype: object

In [11]:
imdb=pd.read_csv('./title.basics.tsv', sep='\t')

/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [12]:
imdb.shape

(5355308, 9)

In [13]:
imdb.sample(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
4738537,tt7866974,tvSeries,Nej D'Lux,Nej D'Lux,0,2017,\N,15,"Comedy,Reality-TV"
1535400,tt1589253,tvEpisode,Episode dated 22 January 2010,Episode dated 22 January 2010,0,2010,\N,\N,"Sport,Talk-Show"
4877481,tt8163720,tvEpisode,Episode #1.17,Episode #1.17,0,1975,\N,\N,Drama
1508214,tt1561227,tvEpisode,Episode dated 7 January 1987,Episode dated 7 January 1987,0,1987,\N,\N,Game-Show
2457070,tt2788796,short,At Dawn They Sleep,At Dawn They Sleep,0,2013,\N,18,"Action,Drama,Short"
2188780,tt2280694,tvEpisode,Radio Wars,Radio Wars,0,1995,\N,\N,\N
3900229,tt6055850,tvMiniSeries,A Day in the Life Of,A Day in the Life Of,0,2017,\N,\N,Comedy
1343587,tt1390601,tvEpisode,Chuck Versus the First Kill,Chuck Versus the First Kill,0,2009,\N,43,"Action,Comedy,Drama"
244524,tt0254860,short,Vom Schwein,Vom Schwein,0,1997,\N,10,"Documentary,Short"
4331130,tt6999634,tvEpisode,"The Great Dongumi Scout Battle, the Top Secret...","The Great Dongumi Scout Battle, the Top Secret...",0,1987,\N,\N,"Animation,Comedy"

In [14]:
# check the two title columns

In [15]:
imdb.loc[~(imdb['primaryTitle'] == imdb['originalTitle'])].head()
# difference is due to translations

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
9,tt0000010,short,Employees Leaving the Lumière Factory,La sortie de l'usine Lumière à Lyon,0,1895,\N,1,"Documentary,Short"
11,tt0000012,short,The Arrival of a Train,L'arrivée d'un train à La Ciotat,0,1896,\N,1,"Documentary,Short"
12,tt0000013,short,The Photographical Congress Arrives in Lyon,Neuville-sur-Saône: Débarquement du congrès de...,0,1895,\N,1,"Documentary,Short"
13,tt0000014,short,Tables Turned on the Gardener,L'arroseur arrosé,0,1895,\N,1,"Comedy,Short"
20,tt0000022,short,Blacksmith Scene,Les forgerons,0,1895,\N,1,"Documentary,Short"

In [16]:
# did a quick search on imdb, imdb records as the primary title, netflix also recognises the english title. therefore, to drop the original title column

In [17]:
imdb.drop(['originalTitle', 'endYear'], axis=1, inplace=True)

In [18]:
imdb.rename(columns={'primaryTitle': 'Title', 'startYear': 'Year'}, inplace=True)

In [19]:
imdb.sample(5)

,tconst,titleType,Title,isAdult,Year,runtimeMinutes,genres
4393637,tt7132392,tvEpisode,Episode #1.110,0,2008,\N,Comedy
4235705,tt6794884,tvEpisode,Episode #1.2,0,2017,\N,Comedy
4111459,tt6522660,tvMovie,Filming My Father: In Life and Death,0,2015,\N,Documentary
2796379,tt3583378,tvEpisode,Tease,0,2013,\N,Comedy
3611144,tt5410956,tvEpisode,Episode #1.5777,0,\N,\N,News

In [20]:
imdb.isnull().sum()

tconst            0
titleType         0
Title             6
isAdult           0
Year              0
runtimeMinutes    0
genres            2
dtype: int64

In [21]:
imdb.dtypes

tconst            object
titleType         object
Title             object
isAdult            int64
Year              object
runtimeMinutes    object
genres            object
dtype: object

In [22]:
imdb['Year'].value_counts().head()

\N      297353
2017    292278
2016    290845
2015    281476
2014    271792
Name: Year, dtype: int64

In [23]:
imdb = imdb.replace(r'\\N', np.nan, regex=True)

In [36]:
# eg. hamlet is a movie and a short. should filter to get movie data only??? not sure yet...
#imdb[imdb['Title'].duplicated()]

# ask edo this

In [24]:
imdb['titleType'].value_counts()

tvEpisode       3643987
short            648868
movie            501024
video            213111
tvSeries         153399
tvMovie          126784
tvMiniSeries      24489
videoGame         22128
tvSpecial         12795
tvShort            8723
Name: titleType, dtype: int64

In [25]:
imdb.duplicated().sum()

0

In [35]:
imdb[imdb['Title'] == 'Hamlet'].head()

         tconst titleType   Title  isAdult  Year runtimeMinutes       genres
626   tt0000630     movie  Hamlet        0  1908            NaN        Drama
627   tt0000631     short  Hamlet        0  1908            NaN  Drama,Short
1229  tt0001240     movie  Hamlet        0  1911            NaN        Drama
1230  tt0001241     short  Hamlet        0  1910             20  Drama,Short
1231  tt0001242     short  Hamlet        0  1908            NaN  Drama,Short

In [26]:
# just gonna take movies
imdb = imdb[imdb['titleType'] == 'movie']

In [27]:
imdb['Year'] = imdb['Year'].astype('float64')

In [28]:
joined = pd.merge(combined, imdb,  how='left', on=['Year','Title'], left_index=True)

In [29]:
joined.sample(5)

,Cust_Id,Rating,Date,Movie_Id,Year,Title,tconst,titleType,isAdult,runtimeMinutes,genres
110157,2217043,5.0,2004-05-01,2782,1995.0,Braveheart,tt0112573,movie,0.0,178,"Biography,Drama,History"
5355305,14833,2.0,2005-06-08,1067,1956.0,Earth vs. The Flying Saucers,NaN,NaN,NaN,NaN,NaN
5355305,2122411,5.0,2005-02-06,2178,1998.0,Lock,NaN,NaN,NaN,NaN,NaN
110157,1966544,5.0,2005-09-28,2782,1995.0,Braveheart,tt0112573,movie,0.0,178,"Biography,Drama,History"
117266,88571,3.0,2000-04-15,3182,1997.0,Private Parts,tt0119951,movie,0.0,109,"Biography,Comedy,Drama"

In [30]:
joined.shape

(1296699, 11)

In [31]:
joined.isnull().sum()

Cust_Id                0
Rating                 0
Date                   0
Movie_Id               0
Year                  13
Title                  0
tconst            290882
titleType         290882
isAdult           290882
runtimeMinutes    294724
genres            292444
dtype: int64

In [32]:
# check. some errors in the dates... how to fix?
#joined[joined['Title'].str.contains('Godfather')]

In [33]:
# gonna drop all nulls
joined = joined.dropna()

In [34]:
joined.shape

(1001783, 11)

In [44]:
joined.head()

,Cust_Id,Rating,Date,Movie_Id,Year,Title,tconst,titleType,isAdult,runtimeMinutes,genres
116788,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,931626,2.0,2004-07-08,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,1628475,4.0,2005-11-14,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,2266857,3.0,2003-06-13,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,402377,4.0,2005-04-10,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"

In [45]:
#imdb2=pd.read_csv('./title.crew.tsv', sep='\t')

In [46]:
#imdb2.head()

In [38]:
imdb3=pd.read_csv('./title.principals.tsv', sep='\t')

In [39]:
imdb3.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [51]:
imdb3['category'].value_counts()

actor                  7322018
actress                5250963
self                   5229972
writer                 3779182
director               3383395
producer               1806779
composer               1127479
cinematographer        1103955
editor                 1033958
production_designer     251591
archive_footage         179625
archive_sound             1911
Name: category, dtype: int64

In [49]:
joined2.head()

,Cust_Id,Rating,Date,Movie_Id,Year,Title,tconst,titleType,isAdult,runtimeMinutes,genres,ordering,nconst,category,job,characters
0,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",10,nm0831114,cinematographer,\N,\N
1,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",1,nm0208798,actor,\N,"[""Jacob 12 jaar""]"
2,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",2,nm0213912,actor,\N,"[""Dreverhaven""]"
3,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",3,nm0404806,actor,\N,"[""Katadreuffe""]"
4,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",4,nm0776926,actress,\N,"[""Joba""]"

In [43]:
imdb3['category'].value_counts()

actor                  7322018
actress                5250963
self                   5229972
writer                 3779182
director               3383395
producer               1806779
composer               1127479
cinematographer        1103955
editor                 1033958
production_designer     251591
archive_footage         179625
archive_sound             1911
Name: category, dtype: int64

In [54]:
# only concerned with actor, actress, director
imdb3 = imdb3[(imdb3['category'] == 'actor') | (imdb3['category'] == 'actress') | (imdb3['category'] == 'director')]

In [55]:
imdb3.head()

       tconst  ordering     nconst  category job      characters
1   tt0000001         2  nm0005690  director  \N              \N
3   tt0000002         1  nm0721526  director  \N              \N
5   tt0000003         1  nm0721526  director  \N              \N
9   tt0000004         1  nm0721526  director  \N              \N
11  tt0000005         1  nm0443482     actor  \N  ["Blacksmith"]

In [61]:
imdb4=pd.read_csv('./name.basics.tsv', sep='\t')

In [62]:
imdb4.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0053137,tt0050419,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0037382,tt0117057,tt0038355,tt0071877"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0059956,tt0049189,tt0054452,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,writer,soundtrack","tt0077975,tt0072562,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0083922,tt0060827,tt0050986,tt0050976"

In [66]:
merged_cast = pd.merge(imdb3, imdb4,  how='inner', on='nconst')

In [67]:
merged_cast.head()

,tconst,ordering,nconst,category,job,characters,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,tt0000001,2,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt6687694,tt1496763,tt1428455,tt0219560"
1,tt0000005,3,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt6687694,tt1496763,tt1428455,tt0219560"
2,tt0000006,1,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt6687694,tt1496763,tt1428455,tt0219560"
3,tt0000007,3,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt6687694,tt1496763,tt1428455,tt0219560"
4,tt0000008,2,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt6687694,tt1496763,tt1428455,tt0219560"

In [68]:
# drop columns that are not needed for analysis
merged_cast.drop(['primaryProfession', 'knownForTitles'], axis=1, inplace=True)

In [69]:
# create a pivot table 
cast_dir = merged_cast.pivot_table(values='primaryName', index='tconst', columns='category', aggfunc='first')

In [70]:
cast_dir.head()

category            actor actress              director
tconst
tt0000001             NaN     NaN  William K.L. Dickson
tt0000002             NaN     NaN         Émile Reynaud
tt0000003             NaN     NaN         Émile Reynaud
tt0000004             NaN     NaN         Émile Reynaud
tt0000005  Charles Kayser     NaN  William K.L. Dickson

In [ ]:
# join to main dataset

In [71]:
joined.head()

,Cust_Id,Rating,Date,Movie_Id,Year,Title,tconst,titleType,isAdult,runtimeMinutes,genres
116788,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,931626,2.0,2004-07-08,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,1628475,4.0,2005-11-14,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,2266857,3.0,2003-06-13,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"
116788,402377,4.0,2005-04-10,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery"

In [72]:
final_df = pd.merge(joined, cast_dir,  how='inner', on='tconst')

In [73]:
final_df.head()

,Cust_Id,Rating,Date,Movie_Id,Year,Title,tconst,titleType,isAdult,runtimeMinutes,genres,actor,actress,director
0,2632461,3.0,2005-07-22,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",Jan Decleir,Betty Schuurman,Mike van Diem
1,931626,2.0,2004-07-08,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",Jan Decleir,Betty Schuurman,Mike van Diem
2,1628475,4.0,2005-11-14,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",Jan Decleir,Betty Schuurman,Mike van Diem
3,2266857,3.0,2003-06-13,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",Jan Decleir,Betty Schuurman,Mike van Diem
4,402377,4.0,2005-04-10,3,1997.0,Character,tt0119448,movie,0.0,122,"Crime,Drama,Mystery",Jan Decleir,Betty Schuurman,Mike van Diem

In [74]:
final_df.shape

(990277, 14)

In [75]:
final_df.isnull().sum()

Cust_Id                0
Rating                 0
Date                   0
Movie_Id               0
Year                   0
Title                  0
tconst                 0
titleType              0
isAdult                0
runtimeMinutes         0
genres                 0
actor              14176
actress           126882
director           32830
dtype: int64

In [76]:
final_df.to_csv('final dataset.csv')

In [ ]:
# which kind of filtering to use? hmm......... 
# should do feature selection first?